app/views/events/show.html.erb

SELECT "guests".* FROM "guests" WHERE "guests"."event_id" = $1  ORDER BY created_at DESC  [["event_id", 11]]
SELECT COUNT(*) FROM "guests" WHERE "guests"."event_id" = $1  [["event_id", 13]]
---
    </div>
  <h4 class="guest-total">total guests: <%= @event.guests.count %></h4>