app/controllers/events_controller.rb

  def create
    redirect_to :root unless @current_user
    @user = @current_user
    @event = @user.events.create(event_params)
---
INSERT INTO "events" ("name", "address", "city", "state", "description", "img_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["name", "test"], ["address", ""], ["city", ""], ["state", ""], ["description", ""], ["img_url", ""], ["created_at", "2016-03-22 16:50:19.199765"], ["updated_at", "2016-03-22 16:50:19.199765"]]

  def edit
    redirect_to :root unless @current_user
    @event = Event.find(params[:id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    redirect_to :root unless @current_user
    @event = Event.find(params[:id])
    if @event.update(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 6]]
UPDATE "events" SET "city" = $1, "date" = $2, "description" = $3, "updated_at" = $4 WHERE "events"."id" = $5  [["city", "DC"], ["date", ""], ["description", "best time ever!"], ["updated_at", "2016-03-21 16:24:50.029885"], ["id", 6]]

  def destroy
    redirect_to :root unless @current_user
    @event = Event.find(params[:id])
    @event.destroy
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 1]]