app/controllers/guests_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "guests" ("name", "message", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "cam"], ["message", "I'm gonna be there!"], ["event_id", 2], ["created_at", "2016-03-21 18:13:48.678015"], ["updated_at", "2016-03-21 18:13:48.678015"]]
---
  def create
    @event = Event.find(params[:event_id])
    @guest = @event.guests.create(guest_params)