app/controllers/sessions_controller.rb

  def create
    input_username = params[:user][:username]
    if User.exists?(username: input_username)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "charles"]]
SELECT  1 AS one FROM "users" WHERE "users"."username" = $1 LIMIT 1  [["username", "charles"]]