app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("username", "password") VALUES ($1, $2) RETURNING "id"  [["username", "cam"], ["password", "c"]]

  def show
    redirect_to :root unless @current_user
    @user = User.find(params[:id])
    @user_events = @user.events.order('created_at DESC')
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "events".* FROM "events"  ORDER BY created_at DESC

  def edit
    redirect_to :root unless @current_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    redirect_to :root unless @current_user
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "password" = $1 WHERE "users"."id" = $2  [["password", "password"], ["id", 3]]